espressif/esp-idf/components/soc/esp32s3/include/soc/host_reg.h
// Copyright 2017-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include "soc.h"

#define HOST_SLCHOST_FUNC2_2_REG (DR_REG_SLCHOST_BASE + 0x20)
/* HOST_SLC_FUNC1_MDSTAT : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define HOST_SLC_FUNC1_MDSTAT (BIT(0))
#define HOST_SLC_FUNC1_MDSTAT_M (BIT(0))
#define HOST_SLC_FUNC1_MDSTAT_V 0x1
#define HOST_SLC_FUNC1_MDSTAT_S 0

#define HOST_SLCHOST_GPIO_STATUS0_REG (DR_REG_SLCHOST_BASE + 0x34)
/* HOST_GPIO_SDIO_INT0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT0 0xFFFFFFFF
#define HOST_GPIO_SDIO_INT0_M ((HOST_GPIO_SDIO_INT0_V) << (HOST_GPIO_SDIO_INT0_S))
#define HOST_GPIO_SDIO_INT0_V 0xFFFFFFFF
#define HOST_GPIO_SDIO_INT0_S 0

#define HOST_SLCHOST_GPIO_STATUS1_REG (DR_REG_SLCHOST_BASE + 0x38)
/* HOST_GPIO_SDIO_INT1 : RO ;bitpos:[21:0] ;default: 22'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT1 0x003FFFFF
#define HOST_GPIO_SDIO_INT1_M ((HOST_GPIO_SDIO_INT1_V) << (HOST_GPIO_SDIO_INT1_S))
#define HOST_GPIO_SDIO_INT1_V 0x3FFFFF
#define HOST_GPIO_SDIO_INT1_S 0

#define HOST_SLCHOST_GPIO_IN0_REG (DR_REG_SLCHOST_BASE + 0x3C)
/* HOST_GPIO_SDIO_IN0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_IN0 0xFFFFFFFF
#define HOST_GPIO_SDIO_IN0_M ((HOST_GPIO_SDIO_IN0_V) << (HOST_GPIO_SDIO_IN0_S))
#define HOST_GPIO_SDIO_IN0_V 0xFFFFFFFF
#define HOST_GPIO_SDIO_IN0_S 0

#define HOST_SLCHOST_GPIO_IN1_REG (DR_REG_SLCHOST_BASE + 0x40)
/* HOST_GPIO_SDIO_IN1 : RO ;bitpos:[21:0] ;default: 22'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_IN1 0x003FFFFF
#define HOST_GPIO_SDIO_IN1_M ((HOST_GPIO_SDIO_IN1_V) << (HOST_GPIO_SDIO_IN1_S))
#define HOST_GPIO_SDIO_IN1_V 0x3FFFFF
#define HOST_GPIO_SDIO_IN1_S 0

#define HOST_SLC0HOST_TOKEN_RDATA_REG (DR_REG_SLCHOST_BASE + 0x44)
/* HOST_SLC0_RX_PF_EOF : RO ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: */
#define HOST_SLC0_RX_PF_EOF 0x0000000F
#define HOST_SLC0_RX_PF_EOF_M ((HOST_SLC0_RX_PF_EOF_V) << (HOST_SLC0_RX_PF_EOF_S))
#define HOST_SLC0_RX_PF_EOF_V 0xF
#define HOST_SLC0_RX_PF_EOF_S 28
/* HOST_HOSTSLC0_TOKEN1 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define HOST_HOSTSLC0_TOKEN1 0x00000FFF
#define HOST_HOSTSLC0_TOKEN1_M ((HOST_HOSTSLC0_TOKEN1_V) << (HOST_HOSTSLC0_TOKEN1_S))
#define HOST_HOSTSLC0_TOKEN1_V 0xFFF
#define HOST_HOSTSLC0_TOKEN1_S 16
/* HOST_SLC0_RX_PF_VALID : RO ;bitpos:[12] ;default: 4'h0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID (BIT(12))
#define HOST_SLC0_RX_PF_VALID_M (BIT(12))
#define HOST_SLC0_RX_PF_VALID_V 0x1
#define HOST_SLC0_RX_PF_VALID_S 12
/* HOST_SLC0_TOKEN0 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define HOST_SLC0_TOKEN0 0x00000FFF
#define HOST_SLC0_TOKEN0_M ((HOST_SLC0_TOKEN0_V) << (HOST_SLC0_TOKEN0_S))
#define HOST_SLC0_TOKEN0_V 0xFFF
#define HOST_SLC0_TOKEN0_S 0

#define HOST_SLC0_HOST_PF_REG (DR_REG_SLCHOST_BASE + 0x48)
/* HOST_SLC0_PF_DATA : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define HOST_SLC0_PF_DATA 0xFFFFFFFF
#define HOST_SLC0_PF_DATA_M ((HOST_SLC0_PF_DATA_V) << (HOST_SLC0_PF_DATA_S))
#define HOST_SLC0_PF_DATA_V 0xFFFFFFFF
#define HOST_SLC0_PF_DATA_S 0

#define HOST_SLC0HOST_INT_RAW_REG (DR_REG_SLCHOST_BASE + 0x50)
/* HOST_GPIO_SDIO_INT_RAW : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT_RAW (BIT(25))
#define HOST_GPIO_SDIO_INT_RAW_M (BIT(25))
#define HOST_GPIO_SDIO_INT_RAW_V 0x1
#define HOST_GPIO_SDIO_INT_RAW_S 25
/* HOST_SLC0_HOST_RD_RETRY_INT_RAW : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW_M (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW_V 0x1
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW_S 24
/* HOST_SLC0_RX_NEW_PACKET_INT_RAW : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW_M (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW_V 0x1
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW_S 23
/* HOST_SLC0_EXT_BIT3_INT_RAW : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT3_INT_RAW (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_RAW_M (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_RAW_V 0x1
#define HOST_SLC0_EXT_BIT3_INT_RAW_S 22
/* HOST_SLC0_EXT_BIT2_INT_RAW : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT2_INT_RAW (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_RAW_M (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_RAW_V 0x1
#define HOST_SLC0_EXT_BIT2_INT_RAW_S 21
/* HOST_SLC0_EXT_BIT1_INT_RAW : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT1_INT_RAW (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_RAW_M (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_RAW_V 0x1
#define HOST_SLC0_EXT_BIT1_INT_RAW_S 20
/* HOST_SLC0_EXT_BIT0_INT_RAW : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT0_INT_RAW (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_RAW_M (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_RAW_V 0x1
#define HOST_SLC0_EXT_BIT0_INT_RAW_S 19
/* HOST_SLC0_RX_PF_VALID_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID_INT_RAW (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_RAW_M (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_RAW_V 0x1
#define HOST_SLC0_RX_PF_VALID_INT_RAW_S 18
/* HOST_SLC0_TX_OVF_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TX_OVF_INT_RAW (BIT(17))
#define HOST_SLC0_TX_OVF_INT_RAW_M (BIT(17))
#define HOST_SLC0_TX_OVF_INT_RAW_V 0x1
#define HOST_SLC0_TX_OVF_INT_RAW_S 17
/* HOST_SLC0_RX_UDF_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_UDF_INT_RAW (BIT(16))
#define HOST_SLC0_RX_UDF_INT_RAW_M (BIT(16))
#define HOST_SLC0_RX_UDF_INT_RAW_V 0x1
#define HOST_SLC0_RX_UDF_INT_RAW_S 16
/* HOST_SLC0HOST_TX_START_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TX_START_INT_RAW (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_RAW_M (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_RAW_V 0x1
#define HOST_SLC0HOST_TX_START_INT_RAW_S 15
/* HOST_SLC0HOST_RX_START_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_START_INT_RAW (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_RAW_M (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_RAW_V 0x1
#define HOST_SLC0HOST_RX_START_INT_RAW_S 14
/* HOST_SLC0HOST_RX_EOF_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_EOF_INT_RAW (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_RAW_M (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_RAW_V 0x1
#define HOST_SLC0HOST_RX_EOF_INT_RAW_S 13
/* HOST_SLC0HOST_RX_SOF_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_SOF_INT_RAW (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_RAW_M (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_RAW_V 0x1
#define HOST_SLC0HOST_RX_SOF_INT_RAW_S 12
/* HOST_SLC0_TOKEN1_0TO1_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW_M (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW_V 0x1
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW_S 11
/* HOST_SLC0_TOKEN0_0TO1_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW_M (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW_V 0x1
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW_S 10
/* HOST_SLC0_TOKEN1_1TO0_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW_M (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW_V 0x1
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW_S 9
/* HOST_SLC0_TOKEN0_1TO0_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW_M (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW_V 0x1
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW_S 8
/* HOST_SLC0_TOHOST_BIT7_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT7_INT_RAW (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_RAW_M (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT7_INT_RAW_S 7
/* HOST_SLC0_TOHOST_BIT6_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT6_INT_RAW (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_RAW_M (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT6_INT_RAW_S 6
/* HOST_SLC0_TOHOST_BIT5_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT5_INT_RAW (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_RAW_M (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT5_INT_RAW_S 5
/* HOST_SLC0_TOHOST_BIT4_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT4_INT_RAW (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_RAW_M (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT4_INT_RAW_S 4
/* HOST_SLC0_TOHOST_BIT3_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT3_INT_RAW (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_RAW_M (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT3_INT_RAW_S 3
/* HOST_SLC0_TOHOST_BIT2_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT2_INT_RAW (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_RAW_M (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT2_INT_RAW_S 2
/* HOST_SLC0_TOHOST_BIT1_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT1_INT_RAW (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_RAW_M (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT1_INT_RAW_S 1
/* HOST_SLC0_TOHOST_BIT0_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT0_INT_RAW (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_RAW_M (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_RAW_V 0x1
#define HOST_SLC0_TOHOST_BIT0_INT_RAW_S 0

#define HOST_SLC0HOST_INT_ST_REG (DR_REG_SLCHOST_BASE + 0x58)
/* HOST_GPIO_SDIO_INT_ST : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT_ST (BIT(25))
#define HOST_GPIO_SDIO_INT_ST_M (BIT(25))
#define HOST_GPIO_SDIO_INT_ST_V 0x1
#define HOST_GPIO_SDIO_INT_ST_S 25
/* HOST_SLC0_HOST_RD_RETRY_INT_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_HOST_RD_RETRY_INT_ST (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_ST_M (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_ST_V 0x1
#define HOST_SLC0_HOST_RD_RETRY_INT_ST_S 24
/* HOST_SLC0_RX_NEW_PACKET_INT_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_NEW_PACKET_INT_ST (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_ST_M (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_ST_V 0x1
#define HOST_SLC0_RX_NEW_PACKET_INT_ST_S 23
/* HOST_SLC0_EXT_BIT3_INT_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT3_INT_ST (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_ST_M (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_ST_V 0x1
#define HOST_SLC0_EXT_BIT3_INT_ST_S 22
/* HOST_SLC0_EXT_BIT2_INT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT2_INT_ST (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_ST_M (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_ST_V 0x1
#define HOST_SLC0_EXT_BIT2_INT_ST_S 21
/* HOST_SLC0_EXT_BIT1_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT1_INT_ST (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_ST_M (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_ST_V 0x1
#define HOST_SLC0_EXT_BIT1_INT_ST_S 20
/* HOST_SLC0_EXT_BIT0_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT0_INT_ST (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_ST_M (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_ST_V 0x1
#define HOST_SLC0_EXT_BIT0_INT_ST_S 19
/* HOST_SLC0_RX_PF_VALID_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID_INT_ST (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_ST_M (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_ST_V 0x1
#define HOST_SLC0_RX_PF_VALID_INT_ST_S 18
/* HOST_SLC0_TX_OVF_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TX_OVF_INT_ST (BIT(17))
#define HOST_SLC0_TX_OVF_INT_ST_M (BIT(17))
#define HOST_SLC0_TX_OVF_INT_ST_V 0x1
#define HOST_SLC0_TX_OVF_INT_ST_S 17
/* HOST_SLC0_RX_UDF_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_UDF_INT_ST (BIT(16))
#define HOST_SLC0_RX_UDF_INT_ST_M (BIT(16))
#define HOST_SLC0_RX_UDF_INT_ST_V 0x1
#define HOST_SLC0_RX_UDF_INT_ST_S 16
/* HOST_SLC0HOST_TX_START_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TX_START_INT_ST (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_ST_M (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_ST_V 0x1
#define HOST_SLC0HOST_TX_START_INT_ST_S 15
/* HOST_SLC0HOST_RX_START_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_START_INT_ST (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_ST_M (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_ST_V 0x1
#define HOST_SLC0HOST_RX_START_INT_ST_S 14
/* HOST_SLC0HOST_RX_EOF_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_EOF_INT_ST (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_ST_M (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_ST_V 0x1
#define HOST_SLC0HOST_RX_EOF_INT_ST_S 13
/* HOST_SLC0HOST_RX_SOF_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_SOF_INT_ST (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_ST_M (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_ST_V 0x1
#define HOST_SLC0HOST_RX_SOF_INT_ST_S 12
/* HOST_SLC0_TOKEN1_0TO1_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_0TO1_INT_ST (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_ST_M (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_ST_V 0x1
#define HOST_SLC0_TOKEN1_0TO1_INT_ST_S 11
/* HOST_SLC0_TOKEN0_0TO1_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_0TO1_INT_ST (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_ST_M (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_ST_V 0x1
#define HOST_SLC0_TOKEN0_0TO1_INT_ST_S 10
/* HOST_SLC0_TOKEN1_1TO0_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_1TO0_INT_ST (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_ST_M (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_ST_V 0x1
#define HOST_SLC0_TOKEN1_1TO0_INT_ST_S 9
/* HOST_SLC0_TOKEN0_1TO0_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_1TO0_INT_ST (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_ST_M (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_ST_V 0x1
#define HOST_SLC0_TOKEN0_1TO0_INT_ST_S 8
/* HOST_SLC0_TOHOST_BIT7_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT7_INT_ST (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_ST_M (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT7_INT_ST_S 7
/* HOST_SLC0_TOHOST_BIT6_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT6_INT_ST (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_ST_M (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT6_INT_ST_S 6
/* HOST_SLC0_TOHOST_BIT5_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT5_INT_ST (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_ST_M (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT5_INT_ST_S 5
/* HOST_SLC0_TOHOST_BIT4_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT4_INT_ST (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_ST_M (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT4_INT_ST_S 4
/* HOST_SLC0_TOHOST_BIT3_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT3_INT_ST (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_ST_M (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT3_INT_ST_S 3
/* HOST_SLC0_TOHOST_BIT2_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT2_INT_ST (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_ST_M (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT2_INT_ST_S 2
/* HOST_SLC0_TOHOST_BIT1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT1_INT_ST (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_ST_M (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT1_INT_ST_S 1
/* HOST_SLC0_TOHOST_BIT0_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT0_INT_ST (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_ST_M (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_ST_V 0x1
#define HOST_SLC0_TOHOST_BIT0_INT_ST_S 0

#define HOST_SLCHOST_PKT_LEN_REG (DR_REG_SLCHOST_BASE + 0x60)
/* HOST_HOSTSLC0_LEN_CHECK : RO ;bitpos:[31:20] ;default: 10'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN_CHECK 0x00000FFF
#define HOST_HOSTSLC0_LEN_CHECK_M ((HOST_HOSTSLC0_LEN_CHECK_V) << (HOST_HOSTSLC0_LEN_CHECK_S))
#define HOST_HOSTSLC0_LEN_CHECK_V 0xFFF
#define HOST_HOSTSLC0_LEN_CHECK_S 20
/* HOST_HOSTSLC0_LEN : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN 0x000FFFFF
#define HOST_HOSTSLC0_LEN_M ((HOST_HOSTSLC0_LEN_V) << (HOST_HOSTSLC0_LEN_S))
#define HOST_HOSTSLC0_LEN_V 0xFFFFF
#define HOST_HOSTSLC0_LEN_S 0

#define HOST_SLCHOST_STATE_W0_REG (DR_REG_SLCHOST_BASE + 0x64)
/* HOST_SLCHOST_STATE3 : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE3 0x000000FF
#define HOST_SLCHOST_STATE3_M ((HOST_SLCHOST_STATE3_V) << (HOST_SLCHOST_STATE3_S))
#define HOST_SLCHOST_STATE3_V 0xFF
#define HOST_SLCHOST_STATE3_S 24
/* HOST_SLCHOST_STATE2 : RO ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE2 0x000000FF
#define HOST_SLCHOST_STATE2_M ((HOST_SLCHOST_STATE2_V) << (HOST_SLCHOST_STATE2_S))
#define HOST_SLCHOST_STATE2_V 0xFF
#define HOST_SLCHOST_STATE2_S 16
/* HOST_SLCHOST_STATE1 : RO ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE1 0x000000FF
#define HOST_SLCHOST_STATE1_M ((HOST_SLCHOST_STATE1_V) << (HOST_SLCHOST_STATE1_S))
#define HOST_SLCHOST_STATE1_V 0xFF
#define HOST_SLCHOST_STATE1_S 8
/* HOST_SLCHOST_STATE0 : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE0 0x000000FF
#define HOST_SLCHOST_STATE0_M ((HOST_SLCHOST_STATE0_V) << (HOST_SLCHOST_STATE0_S))
#define HOST_SLCHOST_STATE0_V 0xFF
#define HOST_SLCHOST_STATE0_S 0

#define HOST_SLCHOST_STATE_W1_REG (DR_REG_SLCHOST_BASE + 0x68)
/* HOST_SLCHOST_STATE7 : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE7 0x000000FF
#define HOST_SLCHOST_STATE7_M ((HOST_SLCHOST_STATE7_V) << (HOST_SLCHOST_STATE7_S))
#define HOST_SLCHOST_STATE7_V 0xFF
#define HOST_SLCHOST_STATE7_S 24
/* HOST_SLCHOST_STATE6 : RO ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE6 0x000000FF
#define HOST_SLCHOST_STATE6_M ((HOST_SLCHOST_STATE6_V) << (HOST_SLCHOST_STATE6_S))
#define HOST_SLCHOST_STATE6_V 0xFF
#define HOST_SLCHOST_STATE6_S 16
/* HOST_SLCHOST_STATE5 : RO ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE5 0x000000FF
#define HOST_SLCHOST_STATE5_M ((HOST_SLCHOST_STATE5_V) << (HOST_SLCHOST_STATE5_S))
#define HOST_SLCHOST_STATE5_V 0xFF
#define HOST_SLCHOST_STATE5_S 8
/* HOST_SLCHOST_STATE4 : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE4 0x000000FF
#define HOST_SLCHOST_STATE4_M ((HOST_SLCHOST_STATE4_V) << (HOST_SLCHOST_STATE4_S))
#define HOST_SLCHOST_STATE4_V 0xFF
#define HOST_SLCHOST_STATE4_S 0

#define HOST_SLCHOST_CONF_W0_REG (DR_REG_SLCHOST_BASE + 0x6C)
/* HOST_SLCHOST_CONF3 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF3 0x000000FF
#define HOST_SLCHOST_CONF3_M ((HOST_SLCHOST_CONF3_V) << (HOST_SLCHOST_CONF3_S))
#define HOST_SLCHOST_CONF3_V 0xFF
#define HOST_SLCHOST_CONF3_S 24
/* HOST_SLCHOST_CONF2 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF2 0x000000FF
#define HOST_SLCHOST_CONF2_M ((HOST_SLCHOST_CONF2_V) << (HOST_SLCHOST_CONF2_S))
#define HOST_SLCHOST_CONF2_V 0xFF
#define HOST_SLCHOST_CONF2_S 16
/* HOST_SLCHOST_CONF1 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF1 0x000000FF
#define HOST_SLCHOST_CONF1_M ((HOST_SLCHOST_CONF1_V) << (HOST_SLCHOST_CONF1_S))
#define HOST_SLCHOST_CONF1_V 0xFF
#define HOST_SLCHOST_CONF1_S 8
/* HOST_SLCHOST_CONF0 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF0 0x000000FF
#define HOST_SLCHOST_CONF0_M ((HOST_SLCHOST_CONF0_V) << (HOST_SLCHOST_CONF0_S))
#define HOST_SLCHOST_CONF0_V 0xFF
#define HOST_SLCHOST_CONF0_S 0

#define HOST_SLCHOST_CONF_W1_REG (DR_REG_SLCHOST_BASE + 0x70)
/* HOST_SLCHOST_CONF7 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF7 0x000000FF
#define HOST_SLCHOST_CONF7_M ((HOST_SLCHOST_CONF7_V) << (HOST_SLCHOST_CONF7_S))
#define HOST_SLCHOST_CONF7_V 0xFF
#define HOST_SLCHOST_CONF7_S 24
/* HOST_SLCHOST_CONF6 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF6 0x000000FF
#define HOST_SLCHOST_CONF6_M ((HOST_SLCHOST_CONF6_V) << (HOST_SLCHOST_CONF6_S))
#define HOST_SLCHOST_CONF6_V 0xFF
#define HOST_SLCHOST_CONF6_S 16
/* HOST_SLCHOST_CONF5 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF5 0x000000FF
#define HOST_SLCHOST_CONF5_M ((HOST_SLCHOST_CONF5_V) << (HOST_SLCHOST_CONF5_S))
#define HOST_SLCHOST_CONF5_V 0xFF
#define HOST_SLCHOST_CONF5_S 8
/* HOST_SLCHOST_CONF4 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF4 0x000000FF
#define HOST_SLCHOST_CONF4_M ((HOST_SLCHOST_CONF4_V) << (HOST_SLCHOST_CONF4_S))
#define HOST_SLCHOST_CONF4_V 0xFF
#define HOST_SLCHOST_CONF4_S 0

#define HOST_SLCHOST_CONF_W2_REG (DR_REG_SLCHOST_BASE + 0x74)
/* HOST_SLCHOST_CONF11 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF11 0x000000FF
#define HOST_SLCHOST_CONF11_M ((HOST_SLCHOST_CONF11_V) << (HOST_SLCHOST_CONF11_S))
#define HOST_SLCHOST_CONF11_V 0xFF
#define HOST_SLCHOST_CONF11_S 24
/* HOST_SLCHOST_CONF10 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF10 0x000000FF
#define HOST_SLCHOST_CONF10_M ((HOST_SLCHOST_CONF10_V) << (HOST_SLCHOST_CONF10_S))
#define HOST_SLCHOST_CONF10_V 0xFF
#define HOST_SLCHOST_CONF10_S 16
/* HOST_SLCHOST_CONF9 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF9 0x000000FF
#define HOST_SLCHOST_CONF9_M ((HOST_SLCHOST_CONF9_V) << (HOST_SLCHOST_CONF9_S))
#define HOST_SLCHOST_CONF9_V 0xFF
#define HOST_SLCHOST_CONF9_S 8
/* HOST_SLCHOST_CONF8 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF8 0x000000FF
#define HOST_SLCHOST_CONF8_M ((HOST_SLCHOST_CONF8_V) << (HOST_SLCHOST_CONF8_S))
#define HOST_SLCHOST_CONF8_V 0xFF
#define HOST_SLCHOST_CONF8_S 0

