espressif/esp-idf/components/soc/esp32s3/include/soc/host_reg.h
#define HOST_SLCHOST_CONF_W3_REG (DR_REG_SLCHOST_BASE + 0x78)
/* HOST_SLCHOST_CONF15 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF15 0x000000FF
#define HOST_SLCHOST_CONF15_M ((HOST_SLCHOST_CONF15_V) << (HOST_SLCHOST_CONF15_S))
#define HOST_SLCHOST_CONF15_V 0xFF
#define HOST_SLCHOST_CONF15_S 24
/* HOST_SLCHOST_CONF14 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF14 0x000000FF
#define HOST_SLCHOST_CONF14_M ((HOST_SLCHOST_CONF14_V) << (HOST_SLCHOST_CONF14_S))
#define HOST_SLCHOST_CONF14_V 0xFF
#define HOST_SLCHOST_CONF14_S 16
/* HOST_SLCHOST_CONF13 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF13 0x000000FF
#define HOST_SLCHOST_CONF13_M ((HOST_SLCHOST_CONF13_V) << (HOST_SLCHOST_CONF13_S))
#define HOST_SLCHOST_CONF13_V 0xFF
#define HOST_SLCHOST_CONF13_S 8
/* HOST_SLCHOST_CONF12 : R/W ;bitpos:[7:0] ;default: 8'hc0 ; */
/*description: */
#define HOST_SLCHOST_CONF12 0x000000FF
#define HOST_SLCHOST_CONF12_M ((HOST_SLCHOST_CONF12_V) << (HOST_SLCHOST_CONF12_S))
#define HOST_SLCHOST_CONF12_V 0xFF
#define HOST_SLCHOST_CONF12_S 0

#define HOST_SLCHOST_CONF_W4_REG (DR_REG_SLCHOST_BASE + 0x7C)
/* HOST_SLCHOST_CONF19 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: Interrupt to target CPU*/
#define HOST_SLCHOST_CONF19 0x000000FF
#define HOST_SLCHOST_CONF19_M ((HOST_SLCHOST_CONF19_V) << (HOST_SLCHOST_CONF19_S))
#define HOST_SLCHOST_CONF19_V 0xFF
#define HOST_SLCHOST_CONF19_S 24
/* HOST_SLCHOST_CONF18 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF18 0x000000FF
#define HOST_SLCHOST_CONF18_M ((HOST_SLCHOST_CONF18_V) << (HOST_SLCHOST_CONF18_S))
#define HOST_SLCHOST_CONF18_V 0xFF
#define HOST_SLCHOST_CONF18_S 16
/* HOST_SLCHOST_CONF17 : R/W ;bitpos:[15:8] ;default: 8'h1 ; */
/*description: SLC timeout enable*/
#define HOST_SLCHOST_CONF17 0x000000FF
#define HOST_SLCHOST_CONF17_M ((HOST_SLCHOST_CONF17_V) << (HOST_SLCHOST_CONF17_S))
#define HOST_SLCHOST_CONF17_V 0xFF
#define HOST_SLCHOST_CONF17_S 8
/* HOST_SLCHOST_CONF16 : R/W ;bitpos:[7:0] ;default: 8'hFF ; */
/*description: SLC timeout value*/
#define HOST_SLCHOST_CONF16 0x000000FF
#define HOST_SLCHOST_CONF16_M ((HOST_SLCHOST_CONF16_V) << (HOST_SLCHOST_CONF16_S))
#define HOST_SLCHOST_CONF16_V 0xFF
#define HOST_SLCHOST_CONF16_S 0

#define HOST_SLCHOST_CONF_W5_REG (DR_REG_SLCHOST_BASE + 0x80)
/* HOST_SLCHOST_CONF23 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF23 0x000000FF
#define HOST_SLCHOST_CONF23_M ((HOST_SLCHOST_CONF23_V) << (HOST_SLCHOST_CONF23_S))
#define HOST_SLCHOST_CONF23_V 0xFF
#define HOST_SLCHOST_CONF23_S 24
/* HOST_SLCHOST_CONF22 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF22 0x000000FF
#define HOST_SLCHOST_CONF22_M ((HOST_SLCHOST_CONF22_V) << (HOST_SLCHOST_CONF22_S))
#define HOST_SLCHOST_CONF22_V 0xFF
#define HOST_SLCHOST_CONF22_S 16
/* HOST_SLCHOST_CONF21 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF21 0x000000FF
#define HOST_SLCHOST_CONF21_M ((HOST_SLCHOST_CONF21_V) << (HOST_SLCHOST_CONF21_S))
#define HOST_SLCHOST_CONF21_V 0xFF
#define HOST_SLCHOST_CONF21_S 8
/* HOST_SLCHOST_CONF20 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF20 0x000000FF
#define HOST_SLCHOST_CONF20_M ((HOST_SLCHOST_CONF20_V) << (HOST_SLCHOST_CONF20_S))
#define HOST_SLCHOST_CONF20_V 0xFF
#define HOST_SLCHOST_CONF20_S 0

#define HOST_SLCHOST_WIN_CMD_REG (DR_REG_SLCHOST_BASE + 0x84)
/* HOST_SLCHOST_WIN_CMD : R/W ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: */
#define HOST_SLCHOST_WIN_CMD 0x0000FFFF
#define HOST_SLCHOST_WIN_CMD_M ((HOST_SLCHOST_WIN_CMD_V) << (HOST_SLCHOST_WIN_CMD_S))
#define HOST_SLCHOST_WIN_CMD_V 0xFFFF
#define HOST_SLCHOST_WIN_CMD_S 0

#define HOST_SLCHOST_CONF_W6_REG (DR_REG_SLCHOST_BASE + 0x88)
/* HOST_SLCHOST_CONF27 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF27 0x000000FF
#define HOST_SLCHOST_CONF27_M ((HOST_SLCHOST_CONF27_V) << (HOST_SLCHOST_CONF27_S))
#define HOST_SLCHOST_CONF27_V 0xFF
#define HOST_SLCHOST_CONF27_S 24
/* HOST_SLCHOST_CONF26 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF26 0x000000FF
#define HOST_SLCHOST_CONF26_M ((HOST_SLCHOST_CONF26_V) << (HOST_SLCHOST_CONF26_S))
#define HOST_SLCHOST_CONF26_V 0xFF
#define HOST_SLCHOST_CONF26_S 16
/* HOST_SLCHOST_CONF25 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF25 0x000000FF
#define HOST_SLCHOST_CONF25_M ((HOST_SLCHOST_CONF25_V) << (HOST_SLCHOST_CONF25_S))
#define HOST_SLCHOST_CONF25_V 0xFF
#define HOST_SLCHOST_CONF25_S 8
/* HOST_SLCHOST_CONF24 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF24 0x000000FF
#define HOST_SLCHOST_CONF24_M ((HOST_SLCHOST_CONF24_V) << (HOST_SLCHOST_CONF24_S))
#define HOST_SLCHOST_CONF24_V 0xFF
#define HOST_SLCHOST_CONF24_S 0

#define HOST_SLCHOST_CONF_W7_REG (DR_REG_SLCHOST_BASE + 0x8C)
/* HOST_SLCHOST_CONF31 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF31 0x000000FF
#define HOST_SLCHOST_CONF31_M ((HOST_SLCHOST_CONF31_V) << (HOST_SLCHOST_CONF31_S))
#define HOST_SLCHOST_CONF31_V 0xFF
#define HOST_SLCHOST_CONF31_S 24
/* HOST_SLCHOST_CONF30 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF30 0x000000FF
#define HOST_SLCHOST_CONF30_M ((HOST_SLCHOST_CONF30_V) << (HOST_SLCHOST_CONF30_S))
#define HOST_SLCHOST_CONF30_V 0xFF
#define HOST_SLCHOST_CONF30_S 16
/* HOST_SLCHOST_CONF29 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF29 0x000000FF
#define HOST_SLCHOST_CONF29_M ((HOST_SLCHOST_CONF29_V) << (HOST_SLCHOST_CONF29_S))
#define HOST_SLCHOST_CONF29_V 0xFF
#define HOST_SLCHOST_CONF29_S 8
/* HOST_SLCHOST_CONF28 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF28 0x000000FF
#define HOST_SLCHOST_CONF28_M ((HOST_SLCHOST_CONF28_V) << (HOST_SLCHOST_CONF28_S))
#define HOST_SLCHOST_CONF28_V 0xFF
#define HOST_SLCHOST_CONF28_S 0

#define HOST_SLCHOST_PKT_LEN0_REG (DR_REG_SLCHOST_BASE + 0x90)
/* HOST_HOSTSLC0_LEN0_CHECK : RO ;bitpos:[31:20] ;default: 12'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN0_CHECK 0x00000FFF
#define HOST_HOSTSLC0_LEN0_CHECK_M ((HOST_HOSTSLC0_LEN0_CHECK_V) << (HOST_HOSTSLC0_LEN0_CHECK_S))
#define HOST_HOSTSLC0_LEN0_CHECK_V 0xFFF
#define HOST_HOSTSLC0_LEN0_CHECK_S 20
/* HOST_HOSTSLC0_LEN0 : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN0 0x000FFFFF
#define HOST_HOSTSLC0_LEN0_M ((HOST_HOSTSLC0_LEN0_V) << (HOST_HOSTSLC0_LEN0_S))
#define HOST_HOSTSLC0_LEN0_V 0xFFFFF
#define HOST_HOSTSLC0_LEN0_S 0

#define HOST_SLCHOST_PKT_LEN1_REG (DR_REG_SLCHOST_BASE + 0x94)
/* HOST_HOSTSLC0_LEN1_CHECK : RO ;bitpos:[31:20] ;default: 10'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN1_CHECK 0x00000FFF
#define HOST_HOSTSLC0_LEN1_CHECK_M ((HOST_HOSTSLC0_LEN1_CHECK_V) << (HOST_HOSTSLC0_LEN1_CHECK_S))
#define HOST_HOSTSLC0_LEN1_CHECK_V 0xFFF
#define HOST_HOSTSLC0_LEN1_CHECK_S 20
/* HOST_HOSTSLC0_LEN1 : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN1 0x000FFFFF
#define HOST_HOSTSLC0_LEN1_M ((HOST_HOSTSLC0_LEN1_V) << (HOST_HOSTSLC0_LEN1_S))
#define HOST_HOSTSLC0_LEN1_V 0xFFFFF
#define HOST_HOSTSLC0_LEN1_S 0

#define HOST_SLCHOST_PKT_LEN2_REG (DR_REG_SLCHOST_BASE + 0x98)
/* HOST_HOSTSLC0_LEN2_CHECK : RO ;bitpos:[31:20] ;default: 10'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN2_CHECK 0x00000FFF
#define HOST_HOSTSLC0_LEN2_CHECK_M ((HOST_HOSTSLC0_LEN2_CHECK_V) << (HOST_HOSTSLC0_LEN2_CHECK_S))
#define HOST_HOSTSLC0_LEN2_CHECK_V 0xFFF
#define HOST_HOSTSLC0_LEN2_CHECK_S 20
/* HOST_HOSTSLC0_LEN2 : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN2 0x000FFFFF
#define HOST_HOSTSLC0_LEN2_M ((HOST_HOSTSLC0_LEN2_V) << (HOST_HOSTSLC0_LEN2_S))
#define HOST_HOSTSLC0_LEN2_V 0xFFFFF
#define HOST_HOSTSLC0_LEN2_S 0

#define HOST_SLCHOST_CONF_W8_REG (DR_REG_SLCHOST_BASE + 0x9C)
/* HOST_SLCHOST_CONF35 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF35 0x000000FF
#define HOST_SLCHOST_CONF35_M ((HOST_SLCHOST_CONF35_V) << (HOST_SLCHOST_CONF35_S))
#define HOST_SLCHOST_CONF35_V 0xFF
#define HOST_SLCHOST_CONF35_S 24
/* HOST_SLCHOST_CONF34 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF34 0x000000FF
#define HOST_SLCHOST_CONF34_M ((HOST_SLCHOST_CONF34_V) << (HOST_SLCHOST_CONF34_S))
#define HOST_SLCHOST_CONF34_V 0xFF
#define HOST_SLCHOST_CONF34_S 16
/* HOST_SLCHOST_CONF33 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF33 0x000000FF
#define HOST_SLCHOST_CONF33_M ((HOST_SLCHOST_CONF33_V) << (HOST_SLCHOST_CONF33_S))
#define HOST_SLCHOST_CONF33_V 0xFF
#define HOST_SLCHOST_CONF33_S 8
/* HOST_SLCHOST_CONF32 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF32 0x000000FF
#define HOST_SLCHOST_CONF32_M ((HOST_SLCHOST_CONF32_V) << (HOST_SLCHOST_CONF32_S))
#define HOST_SLCHOST_CONF32_V 0xFF
#define HOST_SLCHOST_CONF32_S 0

