espressif/esp-idf/components/soc/esp32s3/include/soc/host_reg.h
#define HOST_SLCHOST_CONF_W9_REG (DR_REG_SLCHOST_BASE + 0xA0)
/* HOST_SLCHOST_CONF39 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF39 0x000000FF
#define HOST_SLCHOST_CONF39_M ((HOST_SLCHOST_CONF39_V) << (HOST_SLCHOST_CONF39_S))
#define HOST_SLCHOST_CONF39_V 0xFF
#define HOST_SLCHOST_CONF39_S 24
/* HOST_SLCHOST_CONF38 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF38 0x000000FF
#define HOST_SLCHOST_CONF38_M ((HOST_SLCHOST_CONF38_V) << (HOST_SLCHOST_CONF38_S))
#define HOST_SLCHOST_CONF38_V 0xFF
#define HOST_SLCHOST_CONF38_S 16
/* HOST_SLCHOST_CONF37 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF37 0x000000FF
#define HOST_SLCHOST_CONF37_M ((HOST_SLCHOST_CONF37_V) << (HOST_SLCHOST_CONF37_S))
#define HOST_SLCHOST_CONF37_V 0xFF
#define HOST_SLCHOST_CONF37_S 8
/* HOST_SLCHOST_CONF36 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF36 0x000000FF
#define HOST_SLCHOST_CONF36_M ((HOST_SLCHOST_CONF36_V) << (HOST_SLCHOST_CONF36_S))
#define HOST_SLCHOST_CONF36_V 0xFF
#define HOST_SLCHOST_CONF36_S 0

#define HOST_SLCHOST_CONF_W10_REG (DR_REG_SLCHOST_BASE + 0xA4)
/* HOST_SLCHOST_CONF43 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF43 0x000000FF
#define HOST_SLCHOST_CONF43_M ((HOST_SLCHOST_CONF43_V) << (HOST_SLCHOST_CONF43_S))
#define HOST_SLCHOST_CONF43_V 0xFF
#define HOST_SLCHOST_CONF43_S 24
/* HOST_SLCHOST_CONF42 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF42 0x000000FF
#define HOST_SLCHOST_CONF42_M ((HOST_SLCHOST_CONF42_V) << (HOST_SLCHOST_CONF42_S))
#define HOST_SLCHOST_CONF42_V 0xFF
#define HOST_SLCHOST_CONF42_S 16
/* HOST_SLCHOST_CONF41 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF41 0x000000FF
#define HOST_SLCHOST_CONF41_M ((HOST_SLCHOST_CONF41_V) << (HOST_SLCHOST_CONF41_S))
#define HOST_SLCHOST_CONF41_V 0xFF
#define HOST_SLCHOST_CONF41_S 8
/* HOST_SLCHOST_CONF40 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF40 0x000000FF
#define HOST_SLCHOST_CONF40_M ((HOST_SLCHOST_CONF40_V) << (HOST_SLCHOST_CONF40_S))
#define HOST_SLCHOST_CONF40_V 0xFF
#define HOST_SLCHOST_CONF40_S 0

#define HOST_SLCHOST_CONF_W11_REG (DR_REG_SLCHOST_BASE + 0xA8)
/* HOST_SLCHOST_CONF47 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF47 0x000000FF
#define HOST_SLCHOST_CONF47_M ((HOST_SLCHOST_CONF47_V) << (HOST_SLCHOST_CONF47_S))
#define HOST_SLCHOST_CONF47_V 0xFF
#define HOST_SLCHOST_CONF47_S 24
/* HOST_SLCHOST_CONF46 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF46 0x000000FF
#define HOST_SLCHOST_CONF46_M ((HOST_SLCHOST_CONF46_V) << (HOST_SLCHOST_CONF46_S))
#define HOST_SLCHOST_CONF46_V 0xFF
#define HOST_SLCHOST_CONF46_S 16
/* HOST_SLCHOST_CONF45 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF45 0x000000FF
#define HOST_SLCHOST_CONF45_M ((HOST_SLCHOST_CONF45_V) << (HOST_SLCHOST_CONF45_S))
#define HOST_SLCHOST_CONF45_V 0xFF
#define HOST_SLCHOST_CONF45_S 8
/* HOST_SLCHOST_CONF44 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF44 0x000000FF
#define HOST_SLCHOST_CONF44_M ((HOST_SLCHOST_CONF44_V) << (HOST_SLCHOST_CONF44_S))
#define HOST_SLCHOST_CONF44_V 0xFF
#define HOST_SLCHOST_CONF44_S 0

#define HOST_SLCHOST_CONF_W12_REG (DR_REG_SLCHOST_BASE + 0xAC)
/* HOST_SLCHOST_CONF51 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF51 0x000000FF
#define HOST_SLCHOST_CONF51_M ((HOST_SLCHOST_CONF51_V) << (HOST_SLCHOST_CONF51_S))
#define HOST_SLCHOST_CONF51_V 0xFF
#define HOST_SLCHOST_CONF51_S 24
/* HOST_SLCHOST_CONF50 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF50 0x000000FF
#define HOST_SLCHOST_CONF50_M ((HOST_SLCHOST_CONF50_V) << (HOST_SLCHOST_CONF50_S))
#define HOST_SLCHOST_CONF50_V 0xFF
#define HOST_SLCHOST_CONF50_S 16
/* HOST_SLCHOST_CONF49 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF49 0x000000FF
#define HOST_SLCHOST_CONF49_M ((HOST_SLCHOST_CONF49_V) << (HOST_SLCHOST_CONF49_S))
#define HOST_SLCHOST_CONF49_V 0xFF
#define HOST_SLCHOST_CONF49_S 8
/* HOST_SLCHOST_CONF48 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF48 0x000000FF
#define HOST_SLCHOST_CONF48_M ((HOST_SLCHOST_CONF48_V) << (HOST_SLCHOST_CONF48_S))
#define HOST_SLCHOST_CONF48_V 0xFF
#define HOST_SLCHOST_CONF48_S 0

#define HOST_SLCHOST_CONF_W13_REG (DR_REG_SLCHOST_BASE + 0xB0)
/* HOST_SLCHOST_CONF55 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF55 0x000000FF
#define HOST_SLCHOST_CONF55_M ((HOST_SLCHOST_CONF55_V) << (HOST_SLCHOST_CONF55_S))
#define HOST_SLCHOST_CONF55_V 0xFF
#define HOST_SLCHOST_CONF55_S 24
/* HOST_SLCHOST_CONF54 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF54 0x000000FF
#define HOST_SLCHOST_CONF54_M ((HOST_SLCHOST_CONF54_V) << (HOST_SLCHOST_CONF54_S))
#define HOST_SLCHOST_CONF54_V 0xFF
#define HOST_SLCHOST_CONF54_S 16
/* HOST_SLCHOST_CONF53 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF53 0x000000FF
#define HOST_SLCHOST_CONF53_M ((HOST_SLCHOST_CONF53_V) << (HOST_SLCHOST_CONF53_S))
#define HOST_SLCHOST_CONF53_V 0xFF
#define HOST_SLCHOST_CONF53_S 8
/* HOST_SLCHOST_CONF52 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF52 0x000000FF
#define HOST_SLCHOST_CONF52_M ((HOST_SLCHOST_CONF52_V) << (HOST_SLCHOST_CONF52_S))
#define HOST_SLCHOST_CONF52_V 0xFF
#define HOST_SLCHOST_CONF52_S 0

#define HOST_SLCHOST_CONF_W14_REG (DR_REG_SLCHOST_BASE + 0xB4)
/* HOST_SLCHOST_CONF59 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF59 0x000000FF
#define HOST_SLCHOST_CONF59_M ((HOST_SLCHOST_CONF59_V) << (HOST_SLCHOST_CONF59_S))
#define HOST_SLCHOST_CONF59_V 0xFF
#define HOST_SLCHOST_CONF59_S 24
/* HOST_SLCHOST_CONF58 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF58 0x000000FF
#define HOST_SLCHOST_CONF58_M ((HOST_SLCHOST_CONF58_V) << (HOST_SLCHOST_CONF58_S))
#define HOST_SLCHOST_CONF58_V 0xFF
#define HOST_SLCHOST_CONF58_S 16
/* HOST_SLCHOST_CONF57 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF57 0x000000FF
#define HOST_SLCHOST_CONF57_M ((HOST_SLCHOST_CONF57_V) << (HOST_SLCHOST_CONF57_S))
#define HOST_SLCHOST_CONF57_V 0xFF
#define HOST_SLCHOST_CONF57_S 8
/* HOST_SLCHOST_CONF56 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF56 0x000000FF
#define HOST_SLCHOST_CONF56_M ((HOST_SLCHOST_CONF56_V) << (HOST_SLCHOST_CONF56_S))
#define HOST_SLCHOST_CONF56_V 0xFF
#define HOST_SLCHOST_CONF56_S 0

#define HOST_SLCHOST_CONF_W15_REG (DR_REG_SLCHOST_BASE + 0xB8)
/* HOST_SLCHOST_CONF63 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF63 0x000000FF
#define HOST_SLCHOST_CONF63_M ((HOST_SLCHOST_CONF63_V) << (HOST_SLCHOST_CONF63_S))
#define HOST_SLCHOST_CONF63_V 0xFF
#define HOST_SLCHOST_CONF63_S 24
/* HOST_SLCHOST_CONF62 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF62 0x000000FF
#define HOST_SLCHOST_CONF62_M ((HOST_SLCHOST_CONF62_V) << (HOST_SLCHOST_CONF62_S))
#define HOST_SLCHOST_CONF62_V 0xFF
#define HOST_SLCHOST_CONF62_S 16
/* HOST_SLCHOST_CONF61 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF61 0x000000FF
#define HOST_SLCHOST_CONF61_M ((HOST_SLCHOST_CONF61_V) << (HOST_SLCHOST_CONF61_S))
#define HOST_SLCHOST_CONF61_V 0xFF
#define HOST_SLCHOST_CONF61_S 8
/* HOST_SLCHOST_CONF60 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF60 0x000000FF
#define HOST_SLCHOST_CONF60_M ((HOST_SLCHOST_CONF60_V) << (HOST_SLCHOST_CONF60_S))
#define HOST_SLCHOST_CONF60_V 0xFF
#define HOST_SLCHOST_CONF60_S 0

#define HOST_SLCHOST_CHECK_SUM0_REG (DR_REG_SLCHOST_BASE + 0xBC)
/* HOST_SLCHOST_CHECK_SUM0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_SLCHOST_CHECK_SUM0 0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM0_M ((HOST_SLCHOST_CHECK_SUM0_V) << (HOST_SLCHOST_CHECK_SUM0_S))
#define HOST_SLCHOST_CHECK_SUM0_V 0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM0_S 0

#define HOST_SLCHOST_CHECK_SUM1_REG (DR_REG_SLCHOST_BASE + 0xC0)
/* HOST_SLCHOST_CHECK_SUM1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_SLCHOST_CHECK_SUM1 0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM1_M ((HOST_SLCHOST_CHECK_SUM1_V) << (HOST_SLCHOST_CHECK_SUM1_S))
#define HOST_SLCHOST_CHECK_SUM1_V 0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM1_S 0

#define HOST_SLC0HOST_TOKEN_WDATA_REG (DR_REG_SLCHOST_BASE + 0xC8)
/* HOST_SLC0HOST_TOKEN1_WD : R/W ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define HOST_SLC0HOST_TOKEN1_WD 0x00000FFF
#define HOST_SLC0HOST_TOKEN1_WD_M ((HOST_SLC0HOST_TOKEN1_WD_V) << (HOST_SLC0HOST_TOKEN1_WD_S))
#define HOST_SLC0HOST_TOKEN1_WD_V 0xFFF
#define HOST_SLC0HOST_TOKEN1_WD_S 16
/* HOST_SLC0HOST_TOKEN0_WD : R/W ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define HOST_SLC0HOST_TOKEN0_WD 0x00000FFF
#define HOST_SLC0HOST_TOKEN0_WD_M ((HOST_SLC0HOST_TOKEN0_WD_V) << (HOST_SLC0HOST_TOKEN0_WD_S))
#define HOST_SLC0HOST_TOKEN0_WD_V 0xFFF
#define HOST_SLC0HOST_TOKEN0_WD_S 0

#define HOST_SLCHOST_TOKEN_CON_REG (DR_REG_SLCHOST_BASE + 0xD0)
/* HOST_SLC0HOST_LEN_WR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_LEN_WR (BIT(8))
#define HOST_SLC0HOST_LEN_WR_M (BIT(8))
#define HOST_SLC0HOST_LEN_WR_V 0x1
#define HOST_SLC0HOST_LEN_WR_S 8
/* HOST_SLC0HOST_TOKEN1_WR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TOKEN1_WR (BIT(3))
#define HOST_SLC0HOST_TOKEN1_WR_M (BIT(3))
#define HOST_SLC0HOST_TOKEN1_WR_V 0x1
#define HOST_SLC0HOST_TOKEN1_WR_S 3
/* HOST_SLC0HOST_TOKEN0_WR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TOKEN0_WR (BIT(2))
#define HOST_SLC0HOST_TOKEN0_WR_M (BIT(2))
#define HOST_SLC0HOST_TOKEN0_WR_V 0x1
#define HOST_SLC0HOST_TOKEN0_WR_S 2
/* HOST_SLC0HOST_TOKEN1_DEC : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TOKEN1_DEC (BIT(1))
#define HOST_SLC0HOST_TOKEN1_DEC_M (BIT(1))
#define HOST_SLC0HOST_TOKEN1_DEC_V 0x1
#define HOST_SLC0HOST_TOKEN1_DEC_S 1
/* HOST_SLC0HOST_TOKEN0_DEC : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TOKEN0_DEC (BIT(0))
#define HOST_SLC0HOST_TOKEN0_DEC_M (BIT(0))
#define HOST_SLC0HOST_TOKEN0_DEC_V 0x1
#define HOST_SLC0HOST_TOKEN0_DEC_S 0

#define HOST_SLC0HOST_INT_CLR_REG (DR_REG_SLCHOST_BASE + 0xD4)
/* HOST_GPIO_SDIO_INT_CLR : WO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT_CLR (BIT(25))
#define HOST_GPIO_SDIO_INT_CLR_M (BIT(25))
#define HOST_GPIO_SDIO_INT_CLR_V 0x1
#define HOST_GPIO_SDIO_INT_CLR_S 25
/* HOST_SLC0_HOST_RD_RETRY_INT_CLR : WO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_HOST_RD_RETRY_INT_CLR (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_CLR_M (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_CLR_V 0x1
#define HOST_SLC0_HOST_RD_RETRY_INT_CLR_S 24
/* HOST_SLC0_RX_NEW_PACKET_INT_CLR : WO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_NEW_PACKET_INT_CLR (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_CLR_M (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_CLR_V 0x1
#define HOST_SLC0_RX_NEW_PACKET_INT_CLR_S 23
/* HOST_SLC0_EXT_BIT3_INT_CLR : WO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT3_INT_CLR (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_CLR_M (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_CLR_V 0x1
#define HOST_SLC0_EXT_BIT3_INT_CLR_S 22
/* HOST_SLC0_EXT_BIT2_INT_CLR : WO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT2_INT_CLR (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_CLR_M (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_CLR_V 0x1
#define HOST_SLC0_EXT_BIT2_INT_CLR_S 21
/* HOST_SLC0_EXT_BIT1_INT_CLR : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT1_INT_CLR (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_CLR_M (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_CLR_V 0x1
#define HOST_SLC0_EXT_BIT1_INT_CLR_S 20
/* HOST_SLC0_EXT_BIT0_INT_CLR : WO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT0_INT_CLR (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_CLR_M (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_CLR_V 0x1
#define HOST_SLC0_EXT_BIT0_INT_CLR_S 19
/* HOST_SLC0_RX_PF_VALID_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID_INT_CLR (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_CLR_M (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_CLR_V 0x1
#define HOST_SLC0_RX_PF_VALID_INT_CLR_S 18
/* HOST_SLC0_TX_OVF_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TX_OVF_INT_CLR (BIT(17))
#define HOST_SLC0_TX_OVF_INT_CLR_M (BIT(17))
#define HOST_SLC0_TX_OVF_INT_CLR_V 0x1
#define HOST_SLC0_TX_OVF_INT_CLR_S 17
/* HOST_SLC0_RX_UDF_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_UDF_INT_CLR (BIT(16))
#define HOST_SLC0_RX_UDF_INT_CLR_M (BIT(16))
#define HOST_SLC0_RX_UDF_INT_CLR_V 0x1
#define HOST_SLC0_RX_UDF_INT_CLR_S 16
/* HOST_SLC0HOST_TX_START_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TX_START_INT_CLR (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_CLR_M (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_CLR_V 0x1
#define HOST_SLC0HOST_TX_START_INT_CLR_S 15
/* HOST_SLC0HOST_RX_START_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_START_INT_CLR (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_CLR_M (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_CLR_V 0x1
#define HOST_SLC0HOST_RX_START_INT_CLR_S 14
/* HOST_SLC0HOST_RX_EOF_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_EOF_INT_CLR (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_CLR_M (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_CLR_V 0x1
#define HOST_SLC0HOST_RX_EOF_INT_CLR_S 13
/* HOST_SLC0HOST_RX_SOF_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_SOF_INT_CLR (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_CLR_M (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_CLR_V 0x1
#define HOST_SLC0HOST_RX_SOF_INT_CLR_S 12
/* HOST_SLC0_TOKEN1_0TO1_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_0TO1_INT_CLR (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_CLR_M (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_CLR_V 0x1
#define HOST_SLC0_TOKEN1_0TO1_INT_CLR_S 11
/* HOST_SLC0_TOKEN0_0TO1_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_0TO1_INT_CLR (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_CLR_M (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_CLR_V 0x1
#define HOST_SLC0_TOKEN0_0TO1_INT_CLR_S 10
/* HOST_SLC0_TOKEN1_1TO0_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_1TO0_INT_CLR (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_CLR_M (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_CLR_V 0x1
#define HOST_SLC0_TOKEN1_1TO0_INT_CLR_S 9
/* HOST_SLC0_TOKEN0_1TO0_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_1TO0_INT_CLR (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_CLR_M (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_CLR_V 0x1
#define HOST_SLC0_TOKEN0_1TO0_INT_CLR_S 8
/* HOST_SLC0_TOHOST_BIT7_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT7_INT_CLR (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_CLR_M (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT7_INT_CLR_S 7
/* HOST_SLC0_TOHOST_BIT6_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT6_INT_CLR (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_CLR_M (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT6_INT_CLR_S 6
/* HOST_SLC0_TOHOST_BIT5_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT5_INT_CLR (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_CLR_M (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT5_INT_CLR_S 5
/* HOST_SLC0_TOHOST_BIT4_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT4_INT_CLR (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_CLR_M (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT4_INT_CLR_S 4
/* HOST_SLC0_TOHOST_BIT3_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT3_INT_CLR (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_CLR_M (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT3_INT_CLR_S 3
/* HOST_SLC0_TOHOST_BIT2_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT2_INT_CLR (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_CLR_M (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT2_INT_CLR_S 2
/* HOST_SLC0_TOHOST_BIT1_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT1_INT_CLR (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_CLR_M (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT1_INT_CLR_S 1
/* HOST_SLC0_TOHOST_BIT0_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT0_INT_CLR (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_CLR_M (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_CLR_V 0x1
#define HOST_SLC0_TOHOST_BIT0_INT_CLR_S 0

