espressif/esp-idf/components/soc/esp32s3/include/soc/host_reg.h
#define HOST_SLCHOSTID_REG (DR_REG_SLCHOST_BASE + 0x17C)
/* HOST_SLCHOST_ID : R/W ;bitpos:[31:0] ;default: 32'h0600 ; */
/*description: */
#define HOST_SLCHOST_ID 0xFFFFFFFF
#define HOST_SLCHOST_ID_M ((HOST_SLCHOST_ID_V) << (HOST_SLCHOST_ID_S))
#define HOST_SLCHOST_ID_V 0xFFFFFFFF
#define HOST_SLCHOST_ID_S 0

#define HOST_SLCHOST_CONF_REG (DR_REG_SLCHOST_BASE + 0x1F0)
/* HOST_HSPEED_CON_EN : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define HOST_HSPEED_CON_EN (BIT(27))
#define HOST_HSPEED_CON_EN_M (BIT(27))
#define HOST_HSPEED_CON_EN_V 0x1
#define HOST_HSPEED_CON_EN_S 27
/* HOST_SDIO_PAD_PULLUP : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define HOST_SDIO_PAD_PULLUP (BIT(26))
#define HOST_SDIO_PAD_PULLUP_M (BIT(26))
#define HOST_SDIO_PAD_PULLUP_V 0x1
#define HOST_SDIO_PAD_PULLUP_S 26
/* HOST_SDIO20_INT_DELAY : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_SDIO20_INT_DELAY (BIT(25))
#define HOST_SDIO20_INT_DELAY_M (BIT(25))
#define HOST_SDIO20_INT_DELAY_V 0x1
#define HOST_SDIO20_INT_DELAY_S 25
/* HOST_FRC_QUICK_IN : R/W ;bitpos:[24:20] ;default: 5'b0 ; */
/*description: */
#define HOST_FRC_QUICK_IN 0x0000001F
#define HOST_FRC_QUICK_IN_M ((HOST_FRC_QUICK_IN_V) << (HOST_FRC_QUICK_IN_S))
#define HOST_FRC_QUICK_IN_V 0x1F
#define HOST_FRC_QUICK_IN_S 20
/* HOST_FRC_POS_SAMP : R/W ;bitpos:[19:15] ;default: 5'b0 ; */
/*description: */
#define HOST_FRC_POS_SAMP 0x0000001F
#define HOST_FRC_POS_SAMP_M ((HOST_FRC_POS_SAMP_V) << (HOST_FRC_POS_SAMP_S))
#define HOST_FRC_POS_SAMP_V 0x1F
#define HOST_FRC_POS_SAMP_S 15
/* HOST_FRC_NEG_SAMP : R/W ;bitpos:[14:10] ;default: 5'b0 ; */
/*description: */
#define HOST_FRC_NEG_SAMP 0x0000001F
#define HOST_FRC_NEG_SAMP_M ((HOST_FRC_NEG_SAMP_V) << (HOST_FRC_NEG_SAMP_S))
#define HOST_FRC_NEG_SAMP_V 0x1F
#define HOST_FRC_NEG_SAMP_S 10
/* HOST_FRC_SDIO20 : R/W ;bitpos:[9:5] ;default: 5'b0 ; */
/*description: */
#define HOST_FRC_SDIO20 0x0000001F
#define HOST_FRC_SDIO20_M ((HOST_FRC_SDIO20_V) << (HOST_FRC_SDIO20_S))
#define HOST_FRC_SDIO20_V 0x1F
#define HOST_FRC_SDIO20_S 5
/* HOST_FRC_SDIO11 : R/W ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: */
#define HOST_FRC_SDIO11 0x0000001F
#define HOST_FRC_SDIO11_M ((HOST_FRC_SDIO11_V) << (HOST_FRC_SDIO11_S))
#define HOST_FRC_SDIO11_V 0x1F
#define HOST_FRC_SDIO11_S 0

#define HOST_SLCHOST_INF_ST_REG (DR_REG_SLCHOST_BASE + 0x1F4)
/* HOST_SDIO_QUICK_IN : RO ;bitpos:[14:10] ;default: 5'b0 ; */
/*description: */
#define HOST_SDIO_QUICK_IN 0x0000001F
#define HOST_SDIO_QUICK_IN_M ((HOST_SDIO_QUICK_IN_V) << (HOST_SDIO_QUICK_IN_S))
#define HOST_SDIO_QUICK_IN_V 0x1F
#define HOST_SDIO_QUICK_IN_S 10
/* HOST_SDIO_NEG_SAMP : RO ;bitpos:[9:5] ;default: 5'b0 ; */
/*description: */
#define HOST_SDIO_NEG_SAMP 0x0000001F
#define HOST_SDIO_NEG_SAMP_M ((HOST_SDIO_NEG_SAMP_V) << (HOST_SDIO_NEG_SAMP_S))
#define HOST_SDIO_NEG_SAMP_V 0x1F
#define HOST_SDIO_NEG_SAMP_S 5
/* HOST_SDIO20_MODE : RO ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: */
#define HOST_SDIO20_MODE 0x0000001F
#define HOST_SDIO20_MODE_M ((HOST_SDIO20_MODE_V) << (HOST_SDIO20_MODE_S))
#define HOST_SDIO20_MODE_V 0x1F
#define HOST_SDIO20_MODE_S 0

#ifdef __cplusplus
}
#endif
